export enum DanceCategory {
  'K-pop' = 'K-pop',
  '브레이킹' = '브레이킹',
  '팝핑' = '팝핑',
  '락킹' = '락킹',
  '왁킹' = '왁킹',
  '힙합' = '힙합',
  '하우스' = '하우스',
  '크럼프' = '크럼프',
  '보깅' = '보깅',
  '코레오그래피' = '코레오그래피',
  '키즈댄스' = '키즈댄스',
  '기타' = '기타',
}

export enum DanceMethod {
  '원데이' = '원데이',
  '정기' = '정기',
}

export enum DanceCapacity {
  '개인' = '개인',
  '그룹' = '그룹',
}

export enum LectureType {
  'dance' = 'dance',
}

export enum EnrollLectureType {
  '진행중' = '진행중',
  '수강 완료' = '수강 완료',
}

export enum LectureProgressType {
  '진행중' = '진행중',
  '마감된 클래스' = '마감된 클래스',
}

export enum UserType {
  USER = 'user',
  LECTURER = 'lecturer',
}

export enum LecturerMyReviewType {
  '전체' = '전체',
  '진행중인 클래스' = '진행중인 클래스',
  '종료된 클래스' = '종료된 클래스',
}

export enum LecturerReviewType {
  '최신순' = '최신순',
  '좋아요순' = '좋아요순',
  '평점 높은순' = '평점 높은순',
  '평점 낮은순' = '평점 낮은순',
}

export enum Week {
  '월' = '월',
  '화' = '화',
  '수' = '수',
  '목' = '목',
  '금' = '금',
  '토' = '토',
  '일' = '일',
}

export enum BankEnum {
  '경남은행' = '39',
  '광주은행' = '34',
  '단위농협(지역농축협)' = '12',
  '부산은행' = '32',
  '새마을금고' = '45',
  '산림조합' = '64',
  '신한은행' = '88',
  '신협' = '48',
  '씨티은행' = '27',
  '우리은행' = '20',
  '우체국예금보험' = '71',
  '저축은행중앙회' = '50',
  '전북은행' = '37',
  '제주은행' = '35',
  '카카오뱅크' = '90',
  '토스뱅크' = '92',
  '하나은행' = '81',
  '홍콩상하이은행' = '54',
  'IBK기업은행' = '03',
  'KB국민은행' = '06',
  'DGB대구은행' = '31',
  'KDB산업은행' = '02',
  'NH농협은행' = '11',
  'SC제일은행' = '23',
  'Sh수협은행' = '07',
  '교보증권' = 'S8',
  '대신증권' = 'SE',
  '메리츠증권' = 'SK',
  '미래에셋증권' = 'S5',
  '부국증권' = 'SM',
  '삼성증권' = 'S3',
  '신영증권' = 'SN',
  '신한금융투자' = 'S2',
  '유안타증권' = 'S0',
  '유진투자증권' = 'SJ',
  '카카오페이증권' = 'SQ',
  '키움증권' = 'SB',
  '토스머니' = '-',
  '토스증권' = 'ST',
  '펀드온라인코리아(한국포스증권)' = 'SR',
  '하나금융투자' = 'SH',
  '하이투자증권' = 'S9',
  '한국투자증권' = 'S6',
  '한화투자증권' = 'SG',
  '현대차증권' = 'SA',
  'DB금융투자' = 'SI',
  'KB증권' = 'S4',
  'KTB투자증권(다올투자증권)' = 'SP',
  'LIG투자증권' = 'SO',
  'NH투자증권' = 'SL',
  'SK증권' = 'SD',
}
